brew "wget"
brew "vim"
brew "git"
brew "git-lfs"
brew "gh"
brew "node"
brew "grep"
brew "ack"
brew "fzf"
brew "zsh"
brew "fastfetch"
brew "tree"
brew "tmux"
brew "openssh"
brew "docker"
brew "gemini-cli"
brew "cmake"
brew "jq"

brew "bat"       # better cat
brew "btop"      # better top
brew "eza"       # better ls
brew "trash-cli" # better rm
brew "fd"        # better find

# brew "coreutils"
# brew "moreutils"
# brew "findutils"
# brew "gnu-sed"

cask "visual-studio-code"
cask "arc"       # browser
cask "google-chrome"
cask "raycast"   # better spotlight
cask "iterm2"
cask "docker"
cask "discord"
cask "obsidian"
cask "rectangle"
cask "android-platform-tools"

cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"

vscode "catppuccin.catppuccin-vsc-icons"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "mhutchie.git-graph"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "pixl-garden.bongocat"
vscode "sainnhe.everforest"
vscode "shd101wyy.markdown-preview-enhanced"
